print ('Привет, проверь свой ум!')
n=""
while n != "4":
    n=input('Сколько будет 2+2? ')
    if n !='4':
        print('Ну ты и лошара неправильно!')
print('Правильно! почти не лох:)')
m=""
while m != '25':
    m=input('Дальше! Сколько будет 5*5? ')
    if m !='25':
        print('Какой же ты лох!')
print('ХММ...')
a=""
while a !='72':
    a=input('Продолжим, 9*8=? ')
    if a != '72':
        print('Ну ты просто петушара ваще')
print('Че умный самый?')
b=""
while b != '10':
    b=input('Лошок,сколько будет 4+3*2? ' )
    if b== '14':
        print('Ты самый тупой на свете!')
    elif b != '10' and b != '14':
        print('Иди учись!')
print ('Лови финалочку тогда...')
last=''
while last != '1024':
    last=input('Получай, сколько будет 2 в 10 степени(2^10)?')
    if last != '1024':
        print('Ха я так и знал что ты тупой')
print('КАК!?')
input()